src/InformationRegisters/СтавкиСотрудников/СтавкиСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтавкиСотрудников</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Ставка</name>
    <type>
      <types>DefinedType.ДенежныеСредства</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СтавкиСотрудников/ManagerModule.bsl
Функция ПолучитьСтавку(СотрудникОтбора, ПериодОтбора)	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтавкиСотрудниковСрезПоследних.Ставка КАК Ставка
		|ИЗ
		|	РегистрСведений.СтавкиСотрудников.СрезПоследних(&ПериодСреза, Сотрудник = &СотрудникОтбора) КАК СтавкиСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("ПериодСреза", ПериодОтбора);
	Запрос.УстановитьПараметр("СотрудникОтбора", СотрудникОтбора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда	
		СтавкаСотрудника = 0;	
	Иначе
	   	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
       	ВыборкаДетальныеЗаписи.Следующий();
		
	  	СтавкаСотрудника = ВыборкаДетальныеЗаписи.Ставка;
	КонецЕсли;
	
	Возврат СтавкаСотрудника;
КонецФункции
